Revit 2027 API
BuiltInFailures.WallFailures.InvalidTopConstraintForLevel Property
 Top Constraint is invalid for the Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidTopConstraintForLevel { get; }
Public Shared ReadOnly Property InvalidTopConstraintForLevel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidTopConstraintForLevel {
	FailureDefinitionId^ get ();
}
static member InvalidTopConstraintForLevel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace